Revit 2025 API
DWFImageQuality Enumeration
An enumerated type listing possible image quality for DWF Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DWFImageQuality
Public Enumeration DWFImageQuality
public enum class DWFImageQuality
type DWFImageQuality
Members
Member name | Value | Description
Default | 10
Low | 11
Medium | 12
High | 13
See Also
Reference
Autodesk.Revit.DB Namespace